LTG2012/xiaozhi-esp32-echoear/main/boards/esp-vocat/esp_vocat.cc
        const esp_err_t temperature_ret = temperature_sensor_get_celsius(temp_sensor, &tsens_value);
        if (temperature_ret != ESP_OK) {
            ++temperature_fail_count_;
            if (temperature_fail_count_ == 1 || (temperature_fail_count_ % 30) == 0) {
                ESP_LOGW(TAG, "Temperature read failed: %s (fail_count=%lu)",
                         esp_err_to_name(temperature_ret), static_cast<unsigned long>(temperature_fail_count_));
            }
        } else {
            temperature_fail_count_ = 0;
        }

        if (read_fail_count_ > 0) {
            ESP_LOGI(TAG, "Charge I2C recovered after %lu failures", static_cast<unsigned long>(read_fail_count_));
            read_fail_count_ = 0;
        }
        ESP_LOGD(TAG, "Battery: voltage=%dmV, current=%dmA, SOC=%d%%",
                 info.voltage_mv, info.current_ma, info.level);
        return true;
    }

private:
    bool TryReadWord(uint8_t reg, int16_t& value, const char* field)
    {
        uint8_t data[2] = {0};
        const esp_err_t ret = TryReadRegs(reg, data, sizeof(data));
        if (ret != ESP_OK) {
            ++read_fail_count_;
            if (read_fail_count_ == 1 || (read_fail_count_ % 30) == 0) {
                ESP_LOGW(TAG, "Charge read failed (%s, reg=0x%02X): %s (fail_count=%lu)",
                         field, reg, esp_err_to_name(ret), static_cast<unsigned long>(read_fail_count_));
            }
            return false;
        }
        value = static_cast<int16_t>(static_cast<uint16_t>(data[0]) |
                                     (static_cast<uint16_t>(data[1]) << 8));
        return true;
    }

    portMUX_TYPE data_lock_ = portMUX_INITIALIZER_UNLOCKED;
    BatteryInfo battery_info_;
    bool data_valid_ = false;
    uint32_t read_fail_count_ = 0;
    uint32_t temperature_fail_count_ = 0;
};

class Cst816s : public I2cDevice {
public:
    struct TouchPoint_t {
        int num = 0;
        int x = -1;
        int y = -1;
    };

    enum TouchEvent {
        TOUCH_NONE,
        TOUCH_PRESS,
        TOUCH_RELEASE,
        TOUCH_HOLD
    };

    Cst816s(i2c_master_bus_handle_t i2c_bus, uint8_t addr) : I2cDevice(i2c_bus, addr)
    {
        read_buffer_ = new uint8_t[6];
        was_touched_ = false;
        press_count_ = 0;

        // Create touch interrupt semaphore
        touch_isr_mux_ = xSemaphoreCreateBinary();
        if (touch_isr_mux_ == NULL) {
            ESP_LOGE(TAG, "Failed to create touch semaphore");
        }
    }

    ~Cst816s()
    {
        delete[] read_buffer_;

        // Delete semaphore if it exists
        if (touch_isr_mux_ != NULL) {
            vSemaphoreDelete(touch_isr_mux_);
            touch_isr_mux_ = NULL;
        }
    }

    bool UpdateTouchPoint()
    {
        const esp_err_t ret = TryReadRegs(0x02, read_buffer_, 6);
        if (ret != ESP_OK) {
            ++read_fail_count_;
            if (read_fail_count_ == 1 || (read_fail_count_ % 30) == 0) {
                ESP_LOGW(TAG, "Touch read failed: %s (fail_count=%lu)",
                         esp_err_to_name(ret), static_cast<unsigned long>(read_fail_count_));
            }
            tp_.num = 0;
            tp_.x = -1;
            tp_.y = -1;
            return false;
        }

        if (read_fail_count_ > 0) {
            ESP_LOGI(TAG, "Touch I2C recovered after %lu failures", static_cast<unsigned long>(read_fail_count_));
            read_fail_count_ = 0;
        }
        tp_.num = read_buffer_[0] & 0x0F;
        tp_.x = ((read_buffer_[1] & 0x0F) << 8) | read_buffer_[2];
        tp_.y = ((read_buffer_[3] & 0x0F) << 8) | read_buffer_[4];
        return true;
    }

    const TouchPoint_t &GetTouchPoint()
    {
        return tp_;
    }

    TouchEvent CheckTouchEvent()
    {
        bool is_touched = (tp_.num > 0);
        TouchEvent event = TOUCH_NONE;

        if (is_touched && !was_touched_) {
            // Press event (transition from not touched to touched)
            press_count_++;
            event = TOUCH_PRESS;
            ESP_LOGI(TAG, "TOUCH PRESS - count: %d, x: %d, y: %d", press_count_, tp_.x, tp_.y);
        } else if (!is_touched && was_touched_) {
            // Release event (transition from touched to not touched)
            event = TOUCH_RELEASE;
            ESP_LOGI(TAG, "TOUCH RELEASE - total presses: %d", press_count_);
        } else if (is_touched && was_touched_) {
            // Continuous touch (hold)
            event = TOUCH_HOLD;
            ESP_LOGD(TAG, "TOUCH HOLD - x: %d, y: %d", tp_.x, tp_.y);
        }

        // Update previous state
        was_touched_ = is_touched;
        return event;
    }

    int GetPressCount() const
    {
        return press_count_;
    }

    void ResetPressCount()
    {
        press_count_ = 0;
    }

    // Semaphore management methods
    SemaphoreHandle_t GetTouchSemaphore()
    {
        return touch_isr_mux_;
    }

    bool WaitForTouchEvent(TickType_t timeout = portMAX_DELAY)
    {
        if (touch_isr_mux_ != NULL) {
            return xSemaphoreTake(touch_isr_mux_, timeout) == pdTRUE;
        }
        return false;
    }

    void NotifyTouchEvent()
    {
        if (touch_isr_mux_ != NULL) {
            BaseType_t xHigherPriorityTaskWoken = pdFALSE;
            xSemaphoreGiveFromISR(touch_isr_mux_, &xHigherPriorityTaskWoken);
            portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
        }
    }

private:
    uint8_t* read_buffer_ = nullptr;
    TouchPoint_t tp_;

    // Touch state tracking
    bool was_touched_;
    int press_count_;

    // Touch interrupt semaphore
    SemaphoreHandle_t touch_isr_mux_;
    uint32_t read_fail_count_ = 0;
};

class EspVocat : public WifiBoard {
private:
    i2c_master_bus_handle_t i2c_bus_ = nullptr;
    i2c_bus_handle_t shared_i2c_bus_handle_ = nullptr;
    Cst816s* cst816s_ = nullptr;
    Charge* charge_ = nullptr;
    Button boot_button_;
    Display* display_ = nullptr;
    PwmBacklight* backlight_ = nullptr;
    esp_timer_handle_t touchpad_timer_;
    esp_lcd_touch_handle_t tp;   // LCD touch handle
    EspVideo* camera_ = nullptr;
    TaskHandle_t charge_task_handle_ = nullptr;
    TaskHandle_t touch_task_handle_ = nullptr;
    TaskHandle_t imu_task_handle_ = nullptr;
    TaskHandle_t touch_slider_task_handle_ = nullptr;
    esp_timer_handle_t emotion_reset_timer_ = nullptr;
    bool bmi270_ready_ = false;
    bool was_charging_ = false;
    uint8_t low_battery_alert_mask_ = 0;
    int low_battery_plays_left_ = 0;
    int64_t next_low_battery_play_ms_ = 0;
    touch_button_handle_t touch_button_handle_ = nullptr;
    bool two_pad_touch_mode_ = false;
    uint32_t touch_pad1_channel_ = 0;
    uint32_t touch_pad2_channel_ = 0;
    uint8_t touch_active_mask_ = 0;
    uint32_t touch_start_channel_ = 0;
    int64_t touch_start_time_us_ = 0;
    bool touch_release_pending_ = false;
    int64_t touch_release_time_us_ = 0;
    bool touch_swipe_detected_ = false;

    static void emotion_reset_timer_callback(void* arg)
    {
        auto* self = static_cast<EspVocat*>(arg);
        if (self && self->display_ != nullptr) {
            self->display_->SetEmotion("neutral");
        }
    }

    void ShowTemporaryEmotion(const char* emotion, uint32_t duration_ms)
    {
        if (display_ == nullptr || emotion == nullptr) {
            return;
        }
        display_->SetEmotion(emotion);
        if (emotion_reset_timer_ != nullptr) {
            esp_timer_stop(emotion_reset_timer_);
            esp_timer_start_once(emotion_reset_timer_, static_cast<uint64_t>(duration_ms) * 1000ULL);
        }
    }

